master/cases/halle/2D/spray_1/run01/0/flowType
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "4.98";
    object      flowType;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
43075
(
0.000148212
0.00190651
0.0131785
0.310765
0.672631
0.78031
0.801772
0.81572
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
33
(
0.000309552
0.00476623
0.0288498
-0.0257675
0.425282
0.518905
0.54328
0.579471
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
520
(
5.55025e-05
-2.5998e-05
-1.3009e-05
2.59233e-06
2.03395e-06
1.19401e-06
4.64272e-07
2.22376e-07
...
)
;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
203
(
0.194964
0.171203
0.170033
0.0905445
0.0591574
0.0387344
0.0281851
0.0207835
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
