master/cases/halle/2D/spray_1/run01/constant/injectorProperties
/*---------------------------------------------------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  1.6                                   | 
|   \  /    A nd           | Web:      http://www.openfoam.org               | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 

FoamFile 
{    version         2.0; 
    format          ascii; 

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary; 
    object          injectorProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
(

// z = 0.0005 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.0005 0 0.001);
            direction       (0 0 1);
            diameter        0.001;
            Cd              1.0;
            mass            0.3959999978;
            nParcels        15000;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (1000.0     1)
                (10000.0     1)
           );
            temperatureProfile 
            (
                (1000.0     305.0)
                (10000.0     305.0)
           );
            velocityProfile 
            (
                (1000.0     -8.89)
                (10000.0     -8.89)
           );
        }
    }

// z = 0.001 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.001 0 0.001);
            direction       (0 0 1);
            diameter        0.001;
            Cd              1.0;
            mass            0.3959999978;
            nParcels        15000;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (1000.0     1)
                (10000.0     1)
           );
            temperatureProfile 
            (
                (1000.0     305.0)
                (10000.0     305.0)
           );
            velocityProfile 
            (
                (1000.0     -10.16)
                (10000.0     -10.16)
           );
        }
    }

// z = 0.002 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.002 0 0.001);
            direction       (0 0 1);
            diameter        0.001;
            Cd              1.0;
            mass            0.3959999978;
            nParcels        15000;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (1000.0     1)
                (10000.0     1)
           );
            temperatureProfile 
            (
                (1000.0     305.0)
                (10000.0     305.0)
           );
            velocityProfile 
            (
                (1000.0     -12.6)
                (10000.0     -12.6)
           );
        }
    }

// z = 0.003 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.003 0 0.001);
            direction       (0 0 1);
            diameter        0.001;
            Cd              1.0;
            mass            0.3959999978;
            nParcels        15000;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (1000.0     1)
                (10000.0     1)
           );
            temperatureProfile 
            (
                (1000.0     305.0)
                (10000.0     305.0)
           );
            velocityProfile 
            (
                (1000.0     -14.24)
                (10000.0     -14.24)
           );
        }
    }

// z = 0.004 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.004 0 0.001);
            direction       (0 0 1);
            diameter        0.001;
            Cd              1.0;
            mass            0.3959999978;
            nParcels        15000;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (1000.0     1)
                (10000.0     1)
           );
            temperatureProfile 
            (
                (1000.0     305.0)
                (10000.0     305.0)
           );
            velocityProfile 
            (
                (1000.0     -15.25)
                (10000.0     -15.25)
           );
        }
    }

// z = 0.005 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.005 0 0.001);
            direction       (0 0 1);
            diameter        0.001;
            Cd              1.0;
            mass            0.3959999978;
            nParcels        15000;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (1000.0     1)
                (10000.0     1)
           );
            temperatureProfile 
            (
                (1000.0     305.0)
                (10000.0     305.0)
           );
            velocityProfile 
            (
                (1000.0     -14.81)
                (10000.0     -14.81)
           );
        }
    }

// z = 0.006 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.006 0 0.001);
            direction       (0 0 1);
            diameter        0.001;
            Cd              1.0;
            mass            0.3959999978;
            nParcels        15000;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (1000.0     1)
                (10000.0     1)
           );
            temperatureProfile 
            (
                (1000.0     305.0)
                (10000.0     305.0)
           );
            velocityProfile 
            (
                (1000.0     -12.94)
                (10000.0     -12.94)
           );
        }
    }

// z = 0.007 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.007 0 0.001);
            direction       (0 0 1);
            diameter        0.001;
            Cd              1.0;
            mass            0.3959999978;
            nParcels        15000;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (1000.0     1)
                (10000.0     1)
           );
            temperatureProfile 
            (
                (1000.0     305.0)
                (10000.0     305.0)
           );
            velocityProfile 
            (
                (1000.0     -9.94)
                (10000.0     -9.94)
           );
        }
    }

// z = 0.008 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.008 0 0.001);
            direction       (0 0 1);
            diameter        0.001;
            Cd              1.0;
            mass            0.3959999978;
            nParcels        15000;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (1000.0     1)
                (10000.0     1)
           );
            temperatureProfile 
            (
                (1000.0     305.0)
                (10000.0     305.0)
           );
            velocityProfile 
            (
                (1000.0     -6.47)
                (10000.0     -6.47)
           );
        }
    }

// z = 0.009 ------------------------------------------------------------------------- 

    {
        injectorType        definedInjector;
        definedInjectorProps
        {
            position        (0.009 0 0.001);
            direction       (0 0 1);
            diameter        0.001;
            Cd              1.0;
            mass            0.3959999978;
            nParcels        15000;
            temperature     305.0;
            X ( 1.0 );
            
            massFlowRateProfile 
            (
                (1000.0     1)
                (10000.0     1)
           );
            temperatureProfile 
            (
                (1000.0     305.0)
                (10000.0     305.0)
           );
            velocityProfile 
            (
                (1000.0     -2.61)
                (10000.0     -2.61)
           );
        }
    }
// ------------------------------------------------------------------------- 
)