master/cases/halle/2D/spray_1/run01/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  1.4                                   | 
|   \  /    A nd           | Web:      http://www.openfoam.org               | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 

FoamFile 
{    version         2.0; 
    format          ascii; 

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary; 
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1;

vertices (
	(0 0 0)
	(0.00999048221582 -0.000872387747307 -0.5)
	(0.00999048221582 0.000872387747307 -0.5)
	(0.0319695430906 -0.00139582039569 -0.5)
	(0.0319695430906 0.00139582039569 -0.5)
	(0.00999048221582 -0.000872387747307 0)
	(0.00999048221582 0.000872387747307 0.0)
	(0.0319695430906 -0.00139582039569 0)
	(0.0319695430906 0.00139582039569 0.0)
	(0.0799238577265 -0.00348955098923 0)
	(0.0799238577265 0.00348955098923 0.0)
	(0.0999048221582 -0.00436193873653 0)
	(0.0999048221582 0.00436193873653 0.0)
	(0 0 0.2)
	(0.00999048221582 -0.000872387747307 0.2)
	(0.00999048221582 0.000872387747307 0.2)
	(0.0319695430906 -0.00139582039569 0.2)
	(0.0319695430906 0.00139582039569 0.2)
	(0.0799238577265 -0.00348955098923 0.2)
	(0.0799238577265 0.00348955098923 0.2)
	(0.0999048221582 -0.00436193873653 0.2)
	(0.0999048221582 0.00436193873653 0.2)
	(0 0 1.5)
	(0.00999048221582 -0.000872387747307 1.5)
	(0.00999048221582 0.000872387747307 1.5)
	(0.0319695430906 -0.00139582039569 1.5)
	(0.0319695430906 0.00139582039569 1.5)
	(0.0799238577265 -0.00348955098923 1.5)
	(0.0799238577265 0.00348955098923 1.5)
	(0.0999048221582 -0.00436193873653 1.5)
	(0.0999048221582 0.00436193873653 1.5)
);

 blocks (
	 hex (1 3 4 2 5 7 8 6) (40 1 75) simpleGrading (1 1 0.05)
	 hex (0 5 6 0 13 14 15 13) (25 1 100) simpleGrading (1 1 7)
	 hex (5 7 8 6 14 16 17 15) (40 1 100) simpleGrading (1 1 7)
	 hex (13 14 15 13 22 23 24 22) (25 1 100) simpleGrading (1 1 6)
	 hex (14 16 17 15 23 25 26 24) (40 1 100) simpleGrading (1 1 6)
	 hex (7 9 10 8 16 18 19 17) (60 1 100) simpleGrading (2.5 1 7)
	 hex (16 18 19 17 25 27 28 26) (60 1 100) simpleGrading (2.5 1 6)
	 hex (9 11 12 10 18 20 21 19) (40 1 100) simpleGrading (0.2 1 7)
	 hex (18 20 21 19 27 29 30 28) (40 1 100) simpleGrading (0.2 1 6)
);

edges (
	 arc 1 2 (0.01 0 -0.5)
	 arc 3 4 (0.032 0 -0.5)
	 arc 5 6 (0.01 0 0.0) 
	 arc 7 8 (0.032 0 0.0)
	 arc 9 10 (0.08 0 0.0)
	 arc 11 12 (0.1 0 0.0)
	 arc 14 15 (0.01 0 0.2)
	 arc 16 17 (0.032 0 0.2)
	 arc 18 19 (0.08 0 0.2)
	 arc 20 21 (0.1 0 0.2)
	 arc 23 24 (0.01 0 1.5)
	 arc 25 26 (0.032 0 1.5)
	 arc 27 28 (0.08 0 1.5)
	 arc 29 30 (0.1 0 1.5)
);

patches
(
	 patch inlet (
		 (1 2 4 3)
	 )
	 wall walls (
		 (1 5 6 2)
		 (3 7 8 4)
		 (0 6 5 0)
		 (7 8 10 9)
		 (9 10 12 11)
		 (20 11 12 21)
		 (29 20 21 30)
	 )
	 wedge back (
		 (1 3 7 5)
		 (0 5 14 13)
		 (5 7 16 14)
		 (7 9 18 16)
		 (9 11 20 18)
		 (13 14 23 22)
		 (14 16 25 23)
		 (16 18 27 25)
		 (18 20 29 27)
	 )
	 wedge front (
		 (2 6 8 4)
		 (0 13 15 6)
		 (6 15 17 8)
		 (8 17 19 10)
		 (10 19 21 12)
		 (13 22 24 15)
		 (15 24 26 17)
		 (17 26 28 19)
		 (19 28 30 21)
	 )
	 patch outlet (
		 (22 23 24 22)
		 (23 25 26 24)
		 (25 27 28 26)
		 (27 29 30 28)
	 )
);

 mergePatchPairs
(
);

// ************************************************************************* // 
