master/cases/halle/2D/spray_1/run01/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       71560;
    }
    walls
    {
        type            wall;
        nFaces          475;
        startFace       71600;
    }
    back
    {
        type            wedge;
        nFaces          36000;
        startFace       72075;
    }
    front
    {
        type            wedge;
        nFaces          36000;
        startFace       108075;
    }
    outlet
    {
        type            patch;
        nFaces          165;
        startFace       144075;
    }
    defaultFaces
    {
        type            empty;
        nFaces          0;
        startFace       144240;
    }
)

// ************************************************************************* //
